cfdCases/mainDomain/caseA00Smooth/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0 ];

internalField   uniform 0.0000;

boundaryField
{
    inlet
    {
	 type 	 zeroGradient;
    }

    outlet
    {
	 type 	 uniformFixedValue;
	 uniformValue 	 constant 0.0000;
    }

    ground 
    {
	 type 	 zeroGradient;
    }
    
    top    
    {
	 type 	 symmetry;
    }

    front    
    {
	 type 	 symmetry;
    }
    
    back    
    {
	 type 	 symmetry;
    }
    
    building 
    {
	 type 	 fixedValue;
	 value 	 uniform 0;
    }
}

// ************************************************************************* //
