cfdCases/mainDomain/caseA00Smooth/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains	56;

decomposer		scotch;

//Needed for compatability
method		scotch;

distributor     	ptscotch;

hierarchicalCoeffs
{
    delta       	0.001;
    order          	xyz;
}


// ************************************************************************* //
