cfdCases/mainDomain/caseA00Smooth/system/pressureSamplingPoints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*----------------------------------------------------------------------------

Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

type            probes;
libs            ("libsampling.so");
writeControl    timeStep;
writeInterval 	10;

fields 		(p);

probeLocations
(
 (-0.038101 -0.050006 0.022860)
 (-0.038101 -0.050006 0.068580)
 (-0.038101 -0.050006 0.114300)
 (-0.038101 -0.050006 0.160020)
 (-0.038101 -0.050006 0.205740)
 (-0.038101 -0.050006 0.251460)
 (-0.038101 -0.050006 0.297180)
 (-0.038101 -0.050006 0.342900)
 (-0.038101 -0.050006 0.388620)
 (-0.038101 -0.050006 0.434340)
 (-0.038101 -0.035719 0.022860)
 (-0.038101 -0.035719 0.068580)
 (-0.038101 -0.035719 0.114300)
 (-0.038101 -0.035719 0.160020)
 (-0.038101 -0.035719 0.205740)
 (-0.038101 -0.035719 0.251460)
 (-0.038101 -0.035719 0.297180)
 (-0.038101 -0.035719 0.342900)
 (-0.038101 -0.035719 0.388620)
 (-0.038101 -0.035719 0.434340)
 (-0.038101 -0.021431 0.022860)
 (-0.038101 -0.021431 0.068580)
 (-0.038101 -0.021431 0.114300)
 (-0.038101 -0.021431 0.160020)
 (-0.038101 -0.021431 0.205740)
 (-0.038101 -0.021431 0.251460)
 (-0.038101 -0.021431 0.297180)
 (-0.038101 -0.021431 0.342900)
 (-0.038101 -0.021431 0.388620)
 (-0.038101 -0.021431 0.434340)
 (-0.038101 -0.007144 0.022860)
 (-0.038101 -0.007144 0.068580)
 (-0.038101 -0.007144 0.114300)
 (-0.038101 -0.007144 0.160020)
 (-0.038101 -0.007144 0.205740)
 (-0.038101 -0.007144 0.251460)
 (-0.038101 -0.007144 0.297180)
 (-0.038101 -0.007144 0.342900)
 (-0.038101 -0.007144 0.388620)
 (-0.038101 -0.007144 0.434340)
 (-0.038101 0.007144 0.022860)
 (-0.038101 0.007144 0.068580)
 (-0.038101 0.007144 0.114300)
 (-0.038101 0.007144 0.160020)
 (-0.038101 0.007144 0.205740)
 (-0.038101 0.007144 0.251460)
 (-0.038101 0.007144 0.297180)
 (-0.038101 0.007144 0.342900)
 (-0.038101 0.007144 0.388620)
 (-0.038101 0.007144 0.434340)
 (-0.038101 0.021431 0.022860)
 (-0.038101 0.021431 0.068580)
 (-0.038101 0.021431 0.114300)
 (-0.038101 0.021431 0.160020)
 (-0.038101 0.021431 0.205740)
 (-0.038101 0.021431 0.251460)
 (-0.038101 0.021431 0.297180)
 (-0.038101 0.021431 0.342900)
 (-0.038101 0.021431 0.388620)
 (-0.038101 0.021431 0.434340)
 (-0.038101 0.035719 0.022860)
 (-0.038101 0.035719 0.068580)
 (-0.038101 0.035719 0.114300)
 (-0.038101 0.035719 0.160020)
 (-0.038101 0.035719 0.205740)
 (-0.038101 0.035719 0.251460)
 (-0.038101 0.035719 0.297180)
 (-0.038101 0.035719 0.342900)
 (-0.038101 0.035719 0.388620)
 (-0.038101 0.035719 0.434340)
 (-0.038101 0.050006 0.022860)
 (-0.038101 0.050006 0.068580)
 (-0.038101 0.050006 0.114300)
 (-0.038101 0.050006 0.160020)
 (-0.038101 0.050006 0.205740)
 (-0.038101 0.050006 0.251460)
 (-0.038101 0.050006 0.297180)
 (-0.038101 0.050006 0.342900)
 (-0.038101 0.050006 0.388620)
 (-0.038101 0.050006 0.434340)
 (0.038101 -0.050006 0.022860)
 (0.038101 -0.050006 0.068580)
 (0.038101 -0.050006 0.114300)
 (0.038101 -0.050006 0.160020)
 (0.038101 -0.050006 0.205740)
 (0.038101 -0.050006 0.251460)
 (0.038101 -0.050006 0.297180)
 (0.038101 -0.050006 0.342900)
 (0.038101 -0.050006 0.388620)
 (0.038101 -0.050006 0.434340)
 (0.038101 -0.035719 0.022860)
 (0.038101 -0.035719 0.068580)
 (0.038101 -0.035719 0.114300)
 (0.038101 -0.035719 0.160020)
 (0.038101 -0.035719 0.205740)
 (0.038101 -0.035719 0.251460)
 (0.038101 -0.035719 0.297180)
 (0.038101 -0.035719 0.342900)
 (0.038101 -0.035719 0.388620)
...
);

// ************************************************************************* //
